 {
    "Context":
    {
        "Hello! What is your name? :" : "",
        "What device are you using? (iPad Air, Samsung Galaxy Tab) :" : "",
        "What OS version are you using? (iOS 10.2, Android Marshmallow) :" : ""
    },
    
    "On-boarding":
    {
    	"Install the app from scratch. Do the on-boarding screens diplay correctly? (y/n) :" : "y",
    	"Does the Get Started button offer you a free sample score? (y/n) :" : "y",
    	"Select a sample score, and press Open My Library...does it download to your library? (y/n) :" : "y",
        "Can you open the chosen sample score? (y/n) :" : "y" 
    },

    "Score viewer":
    {
        "Navigate to 'My Library', and open the sample score, if you haven't opened it. Does the score on-boarding display? (y/n) :" : "y",
        "Do all the videos play as you page through them? (y/n) :" : "y",
        "Does sound play? (y/n) :" : "n",
        "Does tapping outside the on-boarding panel dismiss it? (y/n) :" : "y",
        "Rotate the device. Does the score respond correctly? (y/n) :" : "y",
        "Does swiping left and right page forward and backward through the score? (y/n) :" : "y",
        "Does tapping on the edges of the score page forward and backward through the score? (y/n) :" : "y",
        "Does tilting the device page forward and backward through the score? (y/n) :" : "n",
        "Does swiping the progress indicator and the bottom of the page move forward and backward through the score? (y/n) :"  : "y",
        "Does tapping on the score show and hide the top menu bar? (y/n) :" : "y",
        "Tap the book icon. Does the book menu display? (y/n) :" : "y",
        "Does tapping the various book sections take you to the correct page? (y/n) :" : "y",
        "Tap the fingerings icon. Does the fingerings menu display? (y/n) :" : "y",
        "Does selecting different fingering authors change the little numbers displayed on the score? (y/n) :" : "y",
        "Does selecting 'No fingerings' display fingerings on the score? (y/n) :" : "n",
        "Ignore Annotations for now. Tap the settings icon, does the settings menu display? (y/n) :" : "y",
        "Does selecting sepia background change the background colour? (y/n) :" : "y",
        "Does selecting Printed Layout change the arrangement of the staves? (y/n) :" : "y",
        "Does selecting Printed Layout give you options for adjusting the parameters of the score? (y/n) :" : "n",
        "Does selecting Custom Layout give you options for adjusting the parameters of the score? (y/n) :" : "y",
        "Can you adjust stave spacing? (y/n) :" : "y",
        "Can you specify that movements appear on a new page? (y/n) :" : "y",
        "Tap the print button. Are you given a warning about how long printing may take? (y/n) :" : "y",
        "Does the print menu eventually show? (y/n) :" : "y",
        "Can you print the score? (y/n) :" : "y",
        "Tap the metronome icon. Can you start a metronome at the tempo specified on the score? (y/n) :" : "y",
        "Can you change the tempo of the metronome? (y/n) :" : "y",
        "Can you select a tempo from the list of terms below the metronome? (y/n) :" : "y:",
        "Tap the recording icon. Can you start a new recording, giving it a title? (y/n) :" : "y",
        "Does the app ask for permission to use the microphone? (y/n) :" : "y",
        "Record something. Can you play it back after you've finished? (y/n) :" : "y",
        "Can you change the playback speed of the recording? (y/n) :" : "y",
        "Can you loop playback? (y/n) :" : "y",
        "Can you play the recording backwards? (y/n) :" : "n",
        "Tap the movements button. Can you jump to different movements? (y/n) :" : "y",
        "Can you jump do a different bar number? (y/n) :" :"y"
    },

    "Annotations":
    {
    	"Tap and hold one of the staves. Are you prompted to create a new annotation layer? (y/n) :" : "y",
        "Can you create a new layer without giving it a title? (y/n) :" : "n",
        "Give your layer a title. Does annotation mode load? (y/n) :" : "y",
        "Can you select and draw with each of the pens? (y/n) :" : "y",
        "Can you select and draw with different colours? (y/n) :" : "y",
        "Select the text function. Can you add text to the stave? (y/n) :" : "y",
        "Can you drag and drop various symbols onto the stave? (y/n) :" : "y",
        "Can you select one of your annotations and delete it? (y/n) :" : "y",
        "Press 'Done'. Are you annotations visible on the score? (y/n) :" : "y",
        "Press the annotations icon in the top right of the screen. Can you see your annotation layer? (y/n) :" : "y",
        "Press the share icon beside your annotation layer. Can you share the layer using one of the sharing options? (y/n) :" : "y",
        "iCloud sync test goes here (y/n) :" : "y"
    },

    "Account creation and authentication":
    {
        "Tap the 'Log In' button. Do you get prompted to log in? (y/n) :" : "y",
        "Tap 'Don't have an account? Create an account?'. Are you prompted to create an account? (y/n) :" : "y",
        "Tap the link to the Privacy Policy. Are you taken to the policy on henle-library.com? (y/n) :" : "y",
        "Enter some credentials into the relevant fields, and Sign Up. Do you get a prompt to check your email? (y/n) :" : "y",
        "Go check your email. Have you received the verification email? (y/n) :" : "y",
        "Click the verification link. Are you shown a success message? (y/n) :" : "y",
        "Go back to the app. Tap the user icon in the bottom left corner. Does this bring up the user panel? (y/n) :" : "y",
        "Tap 'Sign out'. ARe you still signed in to your account? (y/n) :" : "n",
        "Tap 'Log In' again. Enter the wrong password for your account. Can you log in? (y/n) :" : "n",
        "Looks like you forgot your password! Tap 'Forgotten Password' Can you send yourself a link to reset your password? (y/n) :" : "y",
        "Check your email. Have you received the link to reset your password? (y/n) :" : "y",
        "Reset your password, then return to the app. Does your old password work? (y/n) :" : "n",
        "Does your new password work? (y/n) :" : "y"
    },

    "Store":
    {
        "Tap on 'Henle Store'. Do the top banners load correctly? (y/n) :" : "y",
        "Are the carousels below populated correctly? (y/n) :" : "y",
        "Tap one of the banners. Does it populate the search correctly? (y/n) :" : "y",
        "Go back to the store front, a tap one of the 'Browse by...' lozenges. Are you taken to the expected category? (y/n) :" : "y",
        "Tap one of the search options therein. Is the search populated as expected? (y/n) :" : "y",
        "Go back to the store front, and tap one of the featured works. Are you taken to the search page? (y/n) :" : "n",
        "Are you taken to the item page? (y/n) :" : "n", 
        "Go back to the store front, tap the search bar, and enter a query. Are you shown results for your search? (y/n) :" : "y",
        "Go back, and enter a composer into the search field. Does the composers name get coverted to a tag above the results? (y/n) :" : "y",
        "Go back, and enter an instrument into the search field. Does the instrument get coverted to a tag above the results? (y/n) :" : "y",
        "Tap the 'Clear all' button. Are the search tags visible? (y/n) :" : "y",
        "Tap the 'Filter' button, and choose a composer. Do the composer's works appear in the results? (y/n) :" : "y",
        "Select another composer. Are their works added to the results? (y/n) :" : "y",
        "Now select an instrumentation. Does this filter the results by that instrument? (y/n) :" : "y",
        "Clear the results. Search for 'Beethoven trios'. Are you shown a list of Piano trio collections and works? (y/n) :" : "y",
        "Clear the results, and search for 'classical flute'. Are you shown a list of flute works from the classical period? (y/n) :" : "y",
        "Select one of these works. Are you taken to the work page? (y/n) :" : "y",
        "Can you tap the score preview and see the first page of the score? (y/n) :" : "y",
        "Press the Buy button. Can you purchase the work? (y/n) :" : "n",
        "Are you prompted to purchase credits? (y/n) :" : "y",
        "Purchase some credits (sign into a sandbox test account if necessary). Does your credits balance update? (y/n) :" : "y",
        "Are you able to purchase the work now? (y/n) :" : "y",
        "Does your credits balance update to reflect the amount you've just spent? (y/n) :" : "y",
        "Is the work now available in your library? (y/n) :" : "y",
        "Go back to the store front, and choose one of the featured bundles listed below the lozenges. Can you purchase one of these bundles, adding more credits if necessary? (y/n) :" : "y",
        "Are all the works in the bundle now downloading in your library? (y/n) :" : "y"
    },

    "Library":
    {
        "Navigate to 'My Library'. Do you see a list of the works you have purchased? (y/n) :" : "y",
        "Can you sort the library by composer and instrumentation? (y/n) :" : "y",
        "Can you filter the library by composer, instrumentation, period and difficulty? (y/n) :" : "y",
        "Can you tap the i button beside a work to view more information about it? (y/n) :" : "y",
        "Can you delete an item from your local storage? (y/n) :" : "y",
        "Does tapping the work open it? (y/n) :" : "y",
        "Can you use the blue arrows to move between the scores in a bundle? (y/n) :" : "y"
    },

    "Server code deploy":
    {
        "Congratulations! You've deployed some server code. Now make sure you haven't broken everything. Open the app. Does the store load? (y/n) :" : "y",
        "Can you sign in to your account? (y/n) :" : "y",
        "Go to the store, and try search for something. DO the search results display? (y/n) :" : "y",
        "Now try to purchase an item. Can you make the purchase? (y/n) :" : "y",
        "Does the item download to your library? (y/n) :" : "y",
        "Can you download other previously purchased scores? (y/n) :" : "y",
        "Can you purchase more credits? (y/n) :" : "y"
    }


}